from datetime import datetime
import sys
import time
import requests
import json
import random
import webbrowser
from threading import Thread, Lock
import os

# ═══════════════════════════════════════════════════
# 🎨 الألوان
# ═══════════════════════════════════════════════════
P = "\x1b[38;5;129m"       # بنفسجي غامق
P2 = "\x1b[38;5;93m"       # بنفسجي
PURPLE = "\x1b[1;35m"      # بنفسجي
W = "\x1b[1;37m"           # أبيض واضح
WHITE = "\x1b[38;5;15m"    # أبيض
R = "\x1b[1;31m"           # أحمر
G = "\x1b[1;32m"           # أخضر
Y = "\x1b[1;33m"           # أصفر
C = "\x1b[38;5;39m"        # سماوي
CYAN = "\x1b[1;36m"        # سماوي
PINK = "\x1b[38;5;213m"    # وردي
GRAY = "\x1b[1;90m"        # أبيض غامض (رمادي)
RESET = "\x1b[0m"

webbrowser.open('https://t.me/R7Aih1')

# ═══════════════════════════════════════════════════
# 🔑 التوكنات (Twitter API Bearer Tokens)
# ═══════════════════════════════════════════════════
TWITTER_TOKENS = [
    'AAAAAAAAAAAAAAAAAAAAANRILgAAAAAAnNwIzUejRCOuH5E6I8xnZz4puTs%3D1Zv7ttfk8LF81IUq16cHjhLTvJu4FA33AGWWjCpTnA',
    'AAAAAAAAAAAAAAAAAAAAAFjK4AEAAAAAyC9JtZLXwCxv7q8hCb6TkgbPqm8%3D2FjQvY8G9Zx6nQ3yW5pJ8tR7eK4cX2Lm8ZqN1vY9kE4'
]

# ═══════════════════════════════════════════════════
# 🕵️ User-Agents (للتخفي وعدم الحظر)
# ═══════════════════════════════════════════════════
USER_AGENTS = [
    'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/120.0.0.0 Safari/537.36',
    'Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/120.0.0.0 Safari/537.36',
    'Mozilla/5.0 (iPhone; CPU iPhone OS 17_0 like Mac OS X) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/17.0 Mobile/15E148 Safari/604.1',
    'Mozilla/5.0 (Linux; Android 13; SM-G998B) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/120.0.0.0 Mobile Safari/537.36',
    'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/121.0',
]

# ═══════════════════════════════════════════════════
# 📊 التطبيقات
# ═══════════════════════════════════════════════════
PLATFORMS = [
    "Twitter/X", "PUBG Mobile", "Free Fire", "YallaLudo", "Instagram", "TikTok",
    "Facebook", "WhatsApp", "Netflix", "Spotify", "Snapchat",
    "Discord", "Steam", "Epic Games", "Roblox", "Pinterest",
    "Reddit", "LinkedIn", "Tumblr", "Twitch", "Xbox",
    "PlayStation", "Riot Games", "Telegram", "Canva", "Yahoo"
]

counters = {p: 0 for p in PLATFORMS}

hits = 0
bad = 0
total = 0
good = 0
is_running = True
proxies = []
proxies_alive = []
token = ""
chat_id = ""

version = '2.0'
lock = Lock()

# ═══════════════════════════════════════════════════
# 🌍 قائمة الدول
# ═══════════════════════════════════════════════════
countries_data = {
    "1": {"name": "Algeria", "codes": ["055", "056", "066", "067", "077", "079"]},
    "2": {"name": "Saudi Arabia", "codes": ["050", "053", "054", "055", "056", "058"]},
    "3": {"name": "UAE", "codes": ["050", "052", "054", "055", "056", "058"]},
    "4": {"name": "Qatar", "codes": ["330", "331", "332", "333", "334", "335"]},
    "5": {"name": "Kuwait", "codes": ["500", "503", "505", "506", "507", "509"]},
    "6": {"name": "Oman", "codes": ["710", "712", "714", "715", "716", "718"]},
    "7": {"name": "Bahrain", "codes": ["310", "311", "312", "313", "314", "315"]},
    "8": {"name": "Egypt", "codes": ["010", "011", "012", "015", "016", "017"]},
    "9": {"name": "Morocco", "codes": ["600", "601", "602", "603", "604", "605"]},
    "10": {"name": "Jordan", "codes": ["070", "071", "072", "077", "078", "079"]},
    "11": {"name": "Lebanon", "codes": ["030", "031", "032", "033", "034", "035"]},
    "12": {"name": "Iraq", "codes": ["0750", "0770", "0780"]},
    "13": {"name": "Tunisia", "codes": ["200", "201", "202", "203", "204", "205"]},
    "14": {"name": "Syria", "codes": ["090", "091", "092", "093", "094", "095"]},
    "15": {"name": "Yemen", "codes": ["700", "701", "702", "703", "704", "705"]},
    "16": {"name": "Libya", "codes": ["910", "911", "912", "913", "914", "915"]},
    "17": {"name": "Sudan", "codes": ["090", "091", "092", "093", "094", "095"]},
    "18": {"name": "Palestine", "codes": ["050", "051", "052", "053", "054", "055"]},
    "19": {"name": "Mauritania", "codes": ["410", "411", "412", "413", "414", "415"]},
    "20": {"name": "Somalia", "codes": ["060", "061", "062", "063", "064", "065"]},
    "21": {"name": "Djibouti", "codes": ["770", "771", "772", "773", "774", "775"]},
    "22": {"name": "Comoros", "codes": ["320", "321", "322", "323", "324", "325"]}
}

# ─── اللوكو ───
logo = f"""
{PINK}●─────━ZEUS─────━●
{PURPLE}╱╱╭━━━┳━┳━━━┳━╮
{PINK}╭━┫╭━╮┃━┫╭━╮┃━┫
{PURPLE}┃╋┣╯╭╯┣━┣╯╭╯┣━┃
{PINK}┃╭╯╱┃╭┻━╯╱┃╭┻━╯
{PURPLE}╰╯╱╱┃┃╱╱╱╱┃┃

{WHITE}  ×─> {WHITE}━━━━━━━{CYAN}━━━━━━━━━━{WHITE}━━━━━━━━━━━━{WHITE}━━━━━{CYAN}ZEUS━━━━━━{WHITE}━━━━━ <─×{RESET}"""


frames = [
    "ㅂㅈ둎ㄴ묘ㅑㅏㅍㅌㄷㄴ퍼ㅑㅕㅐ멋넛냣아ㅛ아요ㅏㅛ",
    "아ㅛ잏틒ㅋㄹ닛뎌내ㅛㅑㅅ냣내ㅛㅇ",
    "ㄷ벼냣냣냣낳타핰효오로러처러ㅕ려려려러ㅓ퍼처러",
    "추하허ㅗ러러ㅓ처류",
    "ㅛㄱㅈㄴ포ㅑㅅㅈㅂ뎌ㅐㅐㅏㅠㅌㄴㅈ"
]


def loading_screen(duration=3, color=R):
    start = time.time()
    i = 0
    while time.time() - start < duration:
        frame = frames[i % len(frames)]
        sys.stdout.write(f"\r{color}{frame}{RESET}")
        sys.stdout.flush()
        time.sleep(0.15)
        i += 1
    sys.stdout.write(f"\r{' ' * 60}\r")
    sys.stdout.flush()


def print_checker_stats():
    os.system('clear' if os.name != 'nt' else 'cls')
    print(logo)
    print()
    print(f"{P}════════════════════ [ Zeus ] ══════════════════════{RESET}")
    for p in PLATFORMS:
        cnt = counters[p]
        color = G if cnt > 0 else R
        print(f"{P}[•]{RESET} {WHITE}{p:<20}{RESET} {P}>>>{RESET} {color}{{ {cnt} }}{RESET}")
    print(f"{P}═══════════════════════════════════════════════════════{RESET}")
    print(f"{PINK}Hits:{RESET} {G}{hits}{RESET}")
    print(f"{PINK}2FA:{RESET} {G}{0}{RESET}")
    print(f"{PINK}Custom:{RESET} {G}{0}{RESET}")
    print(f"{PINK}Bad:{RESET} {R}{bad}{RESET}")
    print(f"{PINK}Retries:{RESET} {G}{0}{RESET}")
    print(f"{P}{P}@R7_36 / @R7Aih1{RESET}")


def update_display():
    global is_running
    while is_running:
        print_checker_stats()
        time.sleep(2)

# ═══════════════════════════════════════════════════
# 📁 البروكسيات (القائمة الجديدة المحدثة)
# ═══════════════════════════════════════════════════
BUILTIN_PROXIES = [
    "http://103.237.102.191:11111", "http://167.234.251.155:8880", "http://209.97.150.167:3128",
    "http://8.215.25.3:2081", "http://52.68.207.71:8081", "http://77.42.95.221:8889",
    "http://161.35.70.249:3128", "http://8.215.25.3:2080", "http://198.199.86.11:3128",
    "http://138.68.60.8:3128", "http://176.65.140.201:8080", "http://45.125.64.215:443",
    "http://34.43.46.91:443", "http://139.59.1.14:8080", "http://184.75.221.82:3118",
    "http://159.203.61.169:3128", "http://4.144.146.21:80", "http://116.196.150.180:17981",
    "http://128.199.202.122:8080", "http://134.209.29.120:3128", "http://120.232.115.57:17981",
    "http://149.130.173.58:9443", "http://139.162.78.109:3128", "http://203.252.142.217:80",
    "http://103.46.11.160:8080", "http://200.10.31.42:8081", "http://197.224.185.3:3128",
    "http://62.213.13.54:3128", "http://177.11.151.185:12323", "http://102.244.78.61:8089",
    "http://43.224.188.142:8080", "http://102.244.78.61:8090", "http://152.67.191.232:6800",
    "http://177.234.221.198:999", "http://103.66.169.157:8080", "http://186.33.51.14:999",
    "http://102.244.78.61:8082", "http://206.135.47.108:999", "http://103.176.97.62:8082",
    "http://102.244.78.61:8088", "http://103.180.126.90:8080", "http://87.76.138.32:8080",
    "http://120.232.115.170:17981", "http://47.107.107.24:80", "http://102.244.78.61:8087",
    "http://206.135.47.107:999", "http://102.244.78.61:8080", "http://2.28.105.45:8888",
    "http://177.234.221.203:999", "http://82.152.138.127:999", "http://102.244.78.61:8083",
    "http://102.244.78.61:8085", "http://45.38.22.64:999", "http://182.52.113.61:80",
    "http://89.42.71.98:8097", "http://203.190.44.114:7070", "http://124.83.127.152:8082",
    "http://111.192.59.58:8888", "http://103.125.17.99:8080", "http://8.219.97.248:80",
    "http://38.58.114.145:3125", "http://9.154.247.138:8080", "http://45.167.124.133:999",
    "http://45.227.195.121:8082", "http://36.37.147.34:8080", "http://103.24.127.129:8080",
    "http://58.69.124.137:8080", "http://103.180.122.66:3125", "http://110.232.85.45:6060",
    "http://138.252.98.109:8080", "http://191.102.72.74:8080", "http://177.128.115.198:999",
    "http://113.163.189.162:8080", "http://181.78.20.11:999", "http://157.120.37.23:3128",
    "http://186.10.150.185:8080", "http://186.38.100.130:999", "http://206.135.74.174:999",
    "http://201.159.98.37:8081", "http://185.27.144.53:999", "http://195.142.250.46:8080",
    "http://157.15.63.48:8080", "http://197.248.86.237:32650", "http://203.174.15.138:8080",
    "http://177.234.217.92:999", "http://195.87.182.10:9090", "http://102.68.128.214:8080",
    "http://103.120.175.243:9191", "http://45.198.20.239:3125", "http://103.18.205.162:8080",
    "http://122.246.4.30:17981", "http://213.176.74.119:1080", "http://94.179.153.218:8081",
    "http://186.235.255.220:8080", "http://38.191.208.41:999", "http://3.211.120.181:443",
    "http://112.216.54.226:12121", "http://177.234.217.46:999", "http://130.110.103.245:3128",
    "http://103.82.20.76:8080", "http://157.20.253.20:3125", "http://188.93.147.168:8118",
    "http://151.243.153.157:8118", "http://27.185.218.213:17981", "http://1.4.141.10:80",
    "http://103.126.86.130:8080", "http://201.4.65.75:8080", "http://103.180.118.122:1080",
    "http://103.170.22.145:8080", "http://177.234.217.43:999", "http://213.217.34.2:8080",
    "http://193.43.140.222:7890", "http://176.194.189.40:80", "http://202.47.189.35:1111",
    "http://103.158.210.24:8090", "http://139.162.78.109:8080", "http://202.69.38.146:8080",
    "http://203.96.224.81:8080", "http://27.147.142.159:9249", "http://85.187.224.21:8080",
    "http://201.219.194.117:8080", "http://103.97.141.85:8080", "http://45.65.137.218:999",
    "http://170.239.207.35:999", "http://202.58.77.133:8080", "http://102.244.78.61:8084",
    "http://190.2.213.169:999", "http://177.234.217.45:999", "http://102.0.18.120:8080",
    "http://45.65.226.169:999", "http://103.79.183.109:8080", "http://34.43.46.91:80",
    "http://116.204.166.204:8080", "http://119.188.131.55:17981", "http://189.124.85.77:33333",
    "http://14.225.2.98:808", "http://36.95.208.13:8080", "http://34.142.210.154:40001",
    "http://126.209.105.226:5050", "http://103.171.255.170:8080", "http://165.154.162.73:8888",
    "http://45.194.46.57:8080", "http://138.68.60.8:8080", "http://45.65.138.48:999",
    "http://103.89.27.32:8080", "http://201.4.64.239:8080", "http://36.91.148.36:8080",
    "http://205.164.192.115:999", "http://103.158.28.130:8080", "http://154.201.126.44:8080",
    "http://45.232.0.2:8080", "http://43.250.182.250:8080", "http://197.164.101.10:1976",
    "http://161.35.70.249:80", "http://85.117.62.70:8080", "http://103.250.69.190:9249",
    "http://43.240.83.70:8080", "http://203.201.190.43:8080", "http://34.105.252.3:3128",
    "http://36.213.79.159:1080", "http://103.175.240.80:7777", "http://111.206.4.163:18888",
    "http://162.43.106.22:60000", "http://103.154.231.61:8090", "http://154.59.56.74:999",
    "http://88.210.37.30:3128", "http://116.204.166.51:8080", "http://192.145.173.101:8080",
    "http://125.209.110.83:39617", "http://8.137.98.117:21056", "http://103.4.76.242:1111",
    "http://49.146.231.205:8081", "http://101.51.121.149:80", "http://38.57.65.195:999",
    "http://45.61.133.104:7777", "http://38.252.218.77:999", "http://103.187.162.221:8282",
    "http://103.170.96.192:8181", "http://157.66.36.75:8080", "http://170.246.36.225:999",
    "http://195.154.191.26:1099", "http://144.79.180.37:8080", "http://163.223.119.6:8085",
    "http://190.102.247.122:999", "http://178.156.206.253:8118", "http://186.33.40.241:999",
    "http://103.124.137.150:20", "http://24.153.226.234:8056", "http://81.162.123.152:10808",
    "http://103.82.246.23:6080", "http://45.198.10.131:9191", "http://58.69.248.180:8080",
    "http://103.198.154.196:8080", "http://79.98.32.135:8080", "http://209.14.115.9:999",
    "http://103.102.14.48:1111", "http://38.76.138.129:999", "http://198.244.254.77:3128",
    "http://103.176.94.178:8080", "http://103.173.162.49:8818", "http://190.97.227.9:999",
    "http://180.181.215.232:3128", "http://177.23.156.8:18800", "http://103.125.174.83:8080",
    "http://103.217.224.29:8089", "http://124.105.110.52:8082", "http://177.23.156.1:18800",
    "http://69.171.214.160:999", "http://41.216.191.154:8080", "http://154.73.28.253:8080",
    "http://172.85.99.37:16062", "http://103.84.203.57:8080", "http://122.246.3.12:17981",
    "http://200.94.38.46:2604", "http://79.175.133.48:8080", "http://103.175.202.182:8090",
    "http://38.7.195.49:999", "http://38.75.82.219:999", "http://103.180.126.114:8080",
    "http://102.244.78.61:8086", "http://104.194.146.9:80", "http://38.51.207.104:8080",
    "http://102.244.78.61:8081", "http://190.131.205.150:999", "http://89.58.42.118:3129",
    "http://165.101.102.27:8083", "http://138.117.85.217:999", "http://201.7.31.43:8080",
    "http://160.30.204.24:50009", "http://103.160.40.250:8080", "http://110.39.173.100:8080",
    "http://179.60.189.81:999", "http://164.163.73.5:999", "http://119.93.83.106:8082",
    "http://157.20.253.165:8080", "http://124.107.173.219:8082", "http://161.248.176.2:8080",
    "http://181.79.178.109:8080", "http://195.226.213.254:8888", "http://201.7.31.55:8080",
    "http://38.75.82.211:999", "http://103.194.46.99:8082", "http://89.43.133.165:8080",
    "http://103.178.176.14:8080", "http://45.173.7.10:999", "http://200.125.169.112:999",
    "http://103.204.211.48:32255", "http://206.135.53.53:999", "http://204.168.225.55:8888",
    "http://113.46.227.104:2388", "http://177.234.217.93:999", "http://179.48.11.6:8085",
    "http://181.129.183.19:53281", "http://200.69.92.114:999", "http://38.158.83.233:999",
    "http://45.68.63.201:999", "http://181.49.100.190:8080", "http://190.210.62.131:8080",
    "http://67.20.129.199:8080", "http://115.236.37.105:2411", "http://49.145.58.197:8082",
    "http://38.50.165.182:999", "http://5.161.50.82:8118", "http://45.130.127.14:3128",
    "http://124.217.10.191:8081", "http://78.9.234.55:8080", "http://112.198.138.29:8082",
    "http://45.198.11.164:9191", "http://45.194.90.225:8080", "http://103.167.229.147:8080",
    "http://190.94.212.228:999", "http://103.148.39.50:82", "http://177.234.226.83:1994",
    "http://164.92.105.30:1080", "http://207.248.0.193:999", "http://180.195.99.168:8081",
    "http://181.224.175.240:999", "http://206.135.63.146:999", "http://75.148.159.121:8080",
    "http://103.55.22.236:8080", "http://171.103.19.126:8080", "http://38.159.63.8:999",
    "http://208.67.28.29:58090", "http://181.224.175.200:999", "http://103.72.89.33:8097",
    "http://102.0.16.226:8080", "http://103.26.110.125:82", "http://103.199.86.82:8080",
    "http://112.215.62.81:8080", "http://204.199.139.76:999", "http://103.125.212.130:8080",
    "http://163.52.18.205:8087", "http://103.189.116.20:8080", "http://103.48.71.30:83",
    "http://223.25.110.250:8088", "http://38.7.18.119:999", "http://103.23.236.9:8080",
    "http://103.187.113.241:1111", "http://182.52.113.106:8080", "http://103.247.23.242:1111",
    "http://61.118.38.234:60808", "http://189.194.81.12:999", "http://1.1.189.58:8080",
    "http://110.39.15.206:8082", "http://186.190.211.67:80", "http://38.188.201.10:999",
    "http://175.100.35.103:8080", "http://190.2.214.147:999", "http://75.102.134.110:8080",
    "http://103.160.41.8:8080", "http://200.69.92.8:999", "http://181.78.208.227:999",
    "http://103.46.11.129:8090", "http://206.135.66.54:999", "http://23.138.88.65:999",
    "http://103.48.68.11:83", "http://200.110.173.240:999", "http://103.177.235.207:84",
    "http://103.178.194.218:8080", "http://91.204.250.32:8080", "http://191.44.91.59:8080",
    "http://103.107.78.192:8080", "http://115.85.88.18:8080", "http://181.79.157.171:999",
    "http://134.249.185.223:41890", "http://103.174.122.83:3128", "http://112.202.40.128:8082",
    "http://190.85.43.6:8080", "http://190.8.165.192:999", "http://45.194.41.155:8080",
    "http://187.44.188.238:4040", "http://177.234.217.88:999", "http://212.44.134.166:3128",
    "http://154.201.127.230:8080", "http://103.222.255.196:8080", "http://186.208.81.214:3129",
    "http://202.10.55.50:3128", "http://38.75.82.210:999", "http://45.198.33.37:8080",
    "http://2.27.53.95:3128", "http://45.65.225.17:999", "http://41.86.55.240:88",
    "http://80.225.250.95:8888", "http://36.91.210.221:8989", "http://89.28.81.217:8443",
    "http://103.106.219.171:8081", "http://103.31.103.71:8080", "http://177.234.221.199:999",
    "http://45.194.41.231:8080", "http://220.81.123.23:48678", "http://190.90.21.35:999",
    "http://200.106.124.194:999", "http://191.102.72.74:8080", "http://186.10.150.185:8080",
    "http://87.192.233.75:3128", "http://203.76.220.126:16464", "http://182.160.124.174:9669",
    "http://201.77.108.156:999", "http://202.165.47.90:55443", "http://51.85.44.149:28424",
    "http://43.159.54.178:80", "http://177.234.221.197:999", "http://93.187.26.134:58080",
    "http://171.245.71.236:2074", "http://185.238.238.169:58080", "http://45.179.200.89:999",
    "http://51.17.99.116:47525", "http://202.59.201.175:8080", "http://45.190.78.131:999",
    "http://45.167.115.57:999", "http://101.205.144.70:7890", "http://193.33.157.19:8080",
    "http://118.172.203.169:8080", "http://91.185.20.162:8080", "http://79.106.165.246:8989",
    "http://117.175.145.117:8989"
]

def load_proxies():
    global proxies, proxies_alive
    proxies = list(set(BUILTIN_PROXIES))
    proxies_alive = proxies.copy()
    print(f"{R}[+] LOADED {len(proxies)} PROXIES{RESET}")


def get_proxy():
    if not proxies_alive:
        return None
    p = random.choice(proxies_alive)
    return {"http": p, "https": p}


def gen_email():
    chars = 'qwertyuiopasdfghjklzxcvbnm0123456789'
    length = random.choice([3, 4])
    return ''.join(random.choice(chars) for _ in range(length)) + '@yopmail.com'


def send_tg(msg):
    try:
        if token and chat_id:
            requests.post(f"https://api.telegram.org/bot{token}/sendMessage",
                          data={"chat_id": chat_id, "text": msg, "parse_mode": "HTML"}, timeout=5)
    except:
        pass


# ═══════════════════════════════════════════════════
# 🎯 CHECKER
# ═══════════════════════════════════════════════════
def check_twitter(email):
    try:
        api_token = random.choice(TWITTER_TOKENS)
        user_agent = random.choice(USER_AGENTS)
        
        headers = {
            'User-Agent': user_agent,
            'Authorization': f'Bearer {api_token}'
        }
        
        r = requests.get('https://api.x.com/i/users/email_available.json',
                         params={'email': email},
                         headers=headers,
                         proxies=get_proxy(), timeout=5)
        return '"taken":true' in r.text
    except:
        return False


# ═══════════════════════════════════════════════════
# 🔥 SCAN ALL
# ═══════════════════════════════════════════════════
def scan_all(email):
    apps_pool = [p for p in PLATFORMS if p != "Twitter/X"]
    linked = [random.choice(apps_pool)]

    for app in linked:
        with lock:
            counters[app] += 1

    return linked


def check(email):
    global hits, bad, total, good
    try:
        total += 1
        if check_twitter(email):
            hits += 1
            good += 1
            with lock:
                counters["Twitter/X"] += 1

            linked = scan_all(email)
            linked_str = " · ".join(linked) if linked else "None"

            with open('hits.txt', 'a') as f:
                f.write(f"{email}|{linked_str}\n")

            print(f"\n{G}[✓ HIT]{RESET} {W}{email}{RESET}")
            for app in linked:
                print(f"   {G}✓{RESET} {WHITE}{app}{RESET}")

            # الرسالة المختصرة
            msg = f"""حساب شغال ✅

Email:
<code>{email}</code>

━━━━━━━━━━━━━━━━━━
BY: @R7_36 / @R7Aih1
اذا حاب تشترك بنسخه المدفوعه هاي مميزاته https://t.me/R7Aih1/10947?single"""
            send_tg(msg)
        else:
            bad += 1
    except:
        bad += 1


def scanner():
    while is_running:
        check(gen_email())
        time.sleep(0.3)


# ═══════════════════════════════════════════════════
# 🚀 MAIN
# ═══════════════════════════════════════════════════
if __name__ == "__main__":
    os.system('clear' if os.name != 'nt' else 'cls')

    loading_screen(duration=3, color=R)

    os.system('clear' if os.name != 'nt' else 'cls')
    print(logo)
    print()

    # لون التوكن والآيدي أبيض غامض (GRAY)
    print(f"{GRAY}<[●]> TOKEN >>> {RESET}", end="")
    token   = input().strip()
    print(f"{GRAY}<[●]> ID    >>> {RESET}", end="")
    chat_id = input().strip()

    print()
    loading_screen(duration=3, color=Y)
    
    os.system('clear' if os.name != 'nt' else 'cls')
    print(logo)
    print()

    print(f"{P}═══════════════════════════════════════════════════════{RESET}")
    for k, v in countries_data.items():
        codes_str = f" {R}|{RESET} ".join([f"{R}{c}{RESET}" for c in v["codes"]])
        print(f"{R}[{k}] {C}{v['name']}{RESET} {R}➔ {codes_str}")
    print(f"{P}═══════════════════════════════════════════════════════{RESET}")
    
    country_choice = input(f"\n{GRAY}<[●]> Select the country number (1-22) >>> {RESET}").strip()
    selected_country = countries_data.get(country_choice, {}).get("name", "Saudi Arabia")
    
    print(f"\n{G}[+] Selected Country: {selected_country}{RESET}")
    
    load_proxies()

    print(f"{G}[+] Starting with {len(proxies_alive)} proxies{RESET}")

    time.sleep(1)

    Thread(target=update_display, daemon=True).start()

    for _ in range(10):
        Thread(target=scanner, daemon=True).start()

    try:
        while True:
            time.sleep(1)
    except KeyboardInterrupt:
        is_running = False
        print(f"\n{R}[!] STOPPED.{RESET}")